netify-soap/src/test/resources/soap/requests/movie/UpdateMovieRemoveCastRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://duo.nl/namespace/netify/general" xmlns:role="http://duo.nl/namespace/netify/datatypes/role" xmlns:act="http://duo.nl/namespace/netify/datatypes/actor">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:UpdateMovieRemoveCastRequest>
            <gen:movieId>11</gen:movieId>
            <gen:cast>
                <role:role>
                    <role:character>Captain kirk</role:character>
                </role:role>
            </gen:cast>
        </gen:UpdateMovieRemoveCastRequest>
    </soapenv:Body>
</soapenv:Envelope>